# ColumnHeaderHeight Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleHeightsOnSheet..::..ColumnHeaderHeight Property
ScheduleHeightsOnSheet Class See Also
---
The height of all schedule header part, including the gap line between header and body.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022.1
# Syntax
C#
---
```text
public double ColumnHeaderHeight { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ColumnHeaderHeight As Double
	Get
```

Visual C++
---
```text
public:
property double ColumnHeaderHeight {
	double get ();
}
```

# See Also
ScheduleHeightsOnSheet Class
Autodesk.Revit.DB Namespace